#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include <math.h> // службові директиви
int main() // початок програми
{
    setlocale (LC_ALL,"ukr"); // зміна локалізації
    printf("Роботу виконав студент групи АI-222 Кулiбаба Сергiй Сергiйович\n"); // відомості про мене
    float a, d1, d2; // уводжу змінні
    printf ("\nВведiть значення d1 =\n"); // програма питає значення зм. Діагоналі 1
    scanf ("%f", &d1); // вводимо значення змінної діагоналі 1
    printf ("\nВведiть значення d2 =\n"); // програма питає значення зм. Діагоналі 2
    scanf ("%f", &d2); // вводимо значення змінної діагоналі 2
    a=sqrt(pow(d1/2,2)+pow(d2/2,2)); // формула розрахунку сторони а
    printf ("\nСторона а = %1.2f\n",a); // виведення результату
    return 0; // кінець
}
