#include <stdio.h>
#include <stdlib.h>
#include <conio.h>
#include <math.h>
#include <locale.h>
#include <stdbool.h>
#define N 7

int main() {
    setlocale(LC_ALL,"rus");
    int i, size = 7;
    float sum = 0.0, A[N], max = A[0], e1, e2;
    printf ("Программу написал Кулибаба Сергей\n");
    printf ("\n");
    printf ("Введите цену одного евро в гривне с учетом копеек (используйте для отделения запятую), за последние семь дней:\n\n");
    for (i = 0; i < N; i++) {
        printf("Цена:", A[i]);
        scanf("%g", &A[i]);
        sum += A[i];

        if(A[i]>max){
            max = A[i];
        }
     }
    printf("\n%.2lf / %d = %.2lf грн средняя цена евро в гривне за неделю\n", sum, size, ((float)(sum / size)));
    printf("\n%.2lf грн максимальная цена евро в гривне за неделю\n", max);
    printf("\nВведите нижнее значение интересующего вас интервала:");
    scanf("%g", &e1);
    printf("\nВведите верхнее значение интересующего вас интервала:");
    scanf("%g", &e2);
    printf ("\nКурс соответствовал заданному вами интервалу в:\n\n");
    if (e1<=A[0]) {
            if (e2>=A[0]){
                printf ("Первый день\n");
            }
    }
    if (e1<=A[1]) {
            if (e2>=A[1]){
                printf ("Второй день\n");
            }
    }
    if (e1<=A[2]) {
            if (e2>=A[2]){
                printf ("Третий день\n");
            }
    }
    if (e1<=A[3]) {
            if (e2>=A[3]){
                printf ("Четвертый день\n");
            }
    }
    if (e1<=A[4]) {
            if (e2>=A[4]){
                printf ("Пятый день\n");
            }
    }
    if (e1<=A[5]) {
            if (e2>=A[5]){
                printf ("Шестой день\n");
            }
    }
    if (e1<=A[6]) {
            if (e2>=A[6]){
                printf ("Седьмой день\n");
            }
    }

    int tmp;
    bool noSwap;

    for (int i = N - 1; i >= 0; i--)
    {
        noSwap = 1;
        for (int j = 0; j < i; j++)
        {
            if (A[j] > A[j + 1])
            {
                tmp = A[j];
                A[j] = A[j + 1];
                A[j + 1] = tmp;
                noSwap = 0;
            }
        }
        if (noSwap == 1)
            break;
    }
    printf ("\nРасположение цены евро в гривне, по возрастанию:\n\n");
    for (int i = 0; i < N; i++)
        printf("%.2f ", A[i]);
    printf("\n");
    return 0;
}















    /*
    int temp; //змінна-буфер для обміну значень елементу масиву
    for (i=0;i<N-1;i++) //кількість проходів на 1 менше довжини масиву
    {
        printf("Prohid %d\n",i+1);
        for (j=0;j<N-i-1;j++) //кількість можливих замін елементів зменшується  по мірі того, як елементи масиву встановлюються у свої місця з кінця
        {
        if(A[j]>A[j+1]) //якщо попередній елемент масиву більший за наступний
        {
        temp=A[j];
        A[j]=A[j+1]; // виконуємо заміну елементів місцями
        A[j+1]=temp;
        }
        printf("Iteracija j=%d\t",j);
        for (k=0;k<N;k++) printf("%d ",A[k]);puts("\n");getch();
        }

    }
    puts("\nVidsortovanij masiv");
    for (i=0;i<N;i++) printf("A[%d]=%d\n",i+1,A[i]); // виведення відсортованого масиву
    return 0;}
*/






 //   for(i = 0;i < N; i++)		//цикл сортировки по возрастанию
//    for(j = 0;j < N-1; j++)		/*цикл обмена значени¤ми элементов - если больший элемент находитс¤ 				  впереди меньшего элемента */
   // if(A[i] > A[j+1]){ //если i-ый элемент больше следующего элемента
   // tmp=A[j+1];	//сохраняем значение следующего элемента в переменной tmp
    //A[j+1]=A[j];	//присваиваем этому элементу значение предыдущего элемента
   // A[j]=tmp;		//i-тому элементу присваиваем значение следующего за ним элемента
   // }
  //  printf("\n\nSORT MASSIV: ");
  //  for(i = 0;i < N;i++)		//выводим на печать отсортированный массив
   // printf("%4d",A[i]);
   // for(i = 0;i < N;i++)		//цикл удалени¤  повторяющихся чисел
   // for(j = 0;j < N-1;j++)
   // if(A[j] ==  A[j+1]){ 	//если j-ый элемент равен следующему элементу
    //    for(;j < N;j++)
   //     A[j]=A[j+2];		//удал¤ем оба элемента, сжимаем массив
   //     n++;			//счетчик  удаляемых элементов
   // }
   // printf("\n\n\nNEW MASSIV: ");
   // for(i = 0;i < N-n*2;i++)		//выводим на печать  массив, состоящий из различных чисел
    //printf("%4d",A[i]);
    //return 0;

